import React from "react";

const About = () => {
  return (
    <div className="py-12" id="about">
      <h1 className="text-3xl font-bold text-center my-8">حولنا</h1>
      <div className="max-w-4xl mx-auto px-4">
        <p className="text-gray-700 text-lg mb-4">
          نحن منصة رائدة في تقديم حلول الواجبات، الأبحاث، وتطوير المشاريع للطلاب
          من جميع المستويات الأكاديمية. هدفنا هو تسهيل العملية التعليمية من خلال
          توفير خدمات عالية الجودة تلبي احتياجات الطلاب بسرعة وكفاءة.
        </p>
        <p className="text-gray-700 text-lg mb-4">
          تأسست منصتنا على مبادئ الاحترافية، السرعة، والدقة. نحن ندرك التحديات
          التي يواجهها الطلاب في إنجاز مهامهم الأكاديمية، ولذلك نلتزم بتقديم
          حلول مخصصة تلبي توقعاتهم وتساعدهم على التفوق في دراستهم.
        </p>
        <p className="text-gray-700 text-lg">
          فريقنا يتكون من خبراء أكاديميين ومطورين محترفين يمتلكون خبرة واسعة في
          مجالاتهم. نحن نستخدم أحدث التقنيات لضمان تقديم خدمات فعالة وموثوقة، مع
          التركيز على رضا العملاء كأولوية قصوى.
        </p>
      </div>
    </div>
  );
};

export default About;
